hw4.org
#+LaTeX_CLASS: article
#+OPTIONS: toc:nil date:nil
#+TITLE: HW4
#+AUTHOR: Ben Iofel

1) We minimize $||\bar{w}||$ because the width of the margin between the support vectors is given by $\frac{2}{||\bar{w}||}$. By maximizing the margin we create the largest distance between classes, making it easier to classify new points. Now, minimizing $\frac{2}{||\bar{w}||}$ is equivalent to minimizing $\frac{1}{2}||\bar{w}||^2$, which is a good function because it has a single global minimum and can be optimized using quadratic programming.
2) Running this gives an accuracy of 60.29%
3) Round 0
  - accuracy = 75.00%
  - \alpha_0 = 0.5493
  - classify negative if glucose < 144.0

  Round 1
  - accuracy = 75.00%
  - \alpha_1 = 0.2759
  - classify negative if age < 29.0

  Round 2
  - accuracy = 75.00%
  - \alpha_2 = 0.2544
  - classify negative if bmi < 30.0
