hw4.tex
% Created 2018-05-06 Sun 22:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Ben Iofel}
\date{}
\title{HW4}
\hypersetup{
 pdfauthor={Ben Iofel},
 pdftitle={HW4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{enumerate}
\item We minimize \(||\bar{w}||\) because the width of the margin between the support vectors is given by \(\frac{2}{||\bar{w}||}\). By maximizing the margin we create the largest distance between classes, making it easier to classify new points. Now, minimizing \(\frac{2}{||\bar{w}||}\) is equivalent to minimizing \(\frac{1}{2}||\bar{w}||^2\), which is a good function because it has a single global minimum and can be optimized using quadratic programming.
\item Running this gives an accuracy of 60.29\%
\item Round 0
\begin{itemize}
\item accuracy = 75.00\%
\item \(\alpha_{\text{0}}\) = 0.5493
\item classify negative if glucose < 144.0
\end{itemize}

Round 1
\begin{itemize}
\item accuracy = 75.00\%
\item \(\alpha_{\text{1}}\) = 0.2759
\item classify negative if age < 29.0
\end{itemize}

Round 2
\begin{itemize}
\item accuracy = 75.00\%
\item \(\alpha_{\text{2}}\) = 0.2544
\item classify negative if bmi < 30.0
\end{itemize}
\end{enumerate}
\end{document}
